data = [11, 22, 22, 33, 44, 44, 44, 55]
s1 = set(data)
print("s1去重之后：", s1)

#2.创建空集合，循环add添加元素
s2 = set()
num_list = [33, 44, 66, 77]
for n in num_list:
    s2.add(n)
print("s2添加完成：", s2)

#3.remove删除元素；in 判断元素是否存在
s2.remove(77)
print("s2删除77之后：", s2)
print("22是否在s1中：", 22 in s1)

#4.集合运算：交集、并集、差集
ji = s1 & s2   #交集，两边共同存在
bing = s1 | s2 #并集，全部去重
cha = s1 - s2  #差集：s1有，s2没有
print(f"交集：{ji}")
print(f"并集：{bing}")
print(f"差集 s1-s2：{cha}")

#5.for遍历集合，len统计集合元素数量
print("---遍历s1集合元素---")
for item in s1:
    print(item)
print(f"s1集合一共有 {len(s1)} 个元素")

# ====================== 集合 set {} ======================
# 集合：无序、可变，**元素不能重复**；自动去重
# 适合：去重、交集、并集、差集（做数据筛选，心理问卷数据处理很实用）
# 创建集合
#s = {10,20,30,20,40}
#print("原始集合，自动去重：", s)

# 1. 增加元素
#s.add(50)                # 添加单个元素
#s.update([60,70])        # 批量添加多个元素

# 2. 删除元素
#s.remove(20)             # 删除指定元素，不存在会报错
#s.discard(999)           # 删除元素，不存在不会报错（推荐优先用这个）
#s.pop()                  # 随机删除一个元素（无序，不要用来精准删）

# 3. 集合运算（数据分析核心！）
#s1 = {1,2,3,4}
#s2 = {3,4,5,6}
#print("并集 s1 | s2：", s1 | s2)   # 全部元素，不去重
#print("交集 s1 & s2：", s1 & s2)   # 两者共有的元素
#print("差集 s1 - s2：", s1 - s2)   # s1有、s2没有的元素
#print("对称差集 s1 ^ s2：", s1 ^ s2) # 两边互不相同的元素

# 4. 内置函数
#print("集合长度len：", len(s))

# 快速去重技巧（把列表转集合，一键去掉重复数据）
#data_list = [1,1,2,2,3]
#data_set = set(data_list)
#print("列表去重结果：", data_set)
